mdhardenburgh/Blinky/Packages/.cache/NXP.LPC54114_DFP.12.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2c_adapter" Cversion="1.0.0" condition="device.LPC54114_AND_driver.common_AND_driver.flexcomm_i2c">
      <description/>
      <files>
        <file category="sourceC" name="components/i2c/flexcomm_i2c_adapter.c"/>
        <file category="header" name="components/i2c/i2c.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="device.LPC54114_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/lists/generic_list.c"/>
        <file category="header" name="components/lists/generic_list.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.0" condition="device.LPC54114_AND_component.lists_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_manager.c"/>
        <file category="header" name="components/serial_manager/serial_manager.h"/>
        <file category="header" name="components/serial_manager/serial_port_internal.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.LPC54114_AND_driver.flexcomm_usart">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_port_uart.c"/>
        <file category="header" name="components/serial_manager/serial_port_uart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter" Cversion="1.0.0" condition="device.LPC54114_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_usart">
      <description/>
      <files>
        <file category="header" name="components/uart/uart.h"/>
        <file category="sourceC" name="components/uart/usart_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.1.0" condition="device.LPC54114_AND_driver.codec_AND_driver.wm8904">
      <description/>
      <files>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="device.LPC54114_AND__CMSIS_Include_core_cm0plus__OR__CMSIS_Include_core_cm4_">
      <description/>
      <files>
        <file condition="core_type.cm0p_AND_mdk" category="sourceAsm" attr="config" name="arm/startup_LPC54114_cm0plus.s"/>
        <file condition="core_type.cm4f_AND_mdk" category="sourceAsm" attr="config" name="arm/startup_LPC54114_cm4.s"/>
        <file condition="core_type.cm0p_AND_iar" category="sourceAsm" attr="config" name="iar/startup_LPC54114_cm0plus.s"/>
        <file condition="core_type.cm4f_AND_iar" category="sourceAsm" attr="config" name="iar/startup_LPC54114_cm4.s"/>
        <file condition="core_type.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54114J256_cm0plus.scf"/>
        <file condition="core_type.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54114J256_cm0plus_ram.scf"/>
        <file condition="core_type.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54114J256_cm4.scf"/>
        <file condition="core_type.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54114J256_cm4_ram.scf"/>
        <file condition="core_type.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54114J256_cm0plus.icf"/>
        <file condition="core_type.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54114J256_cm0plus_ram.icf"/>
        <file condition="core_type.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54114J256_cm4.icf"/>
        <file condition="core_type.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54114J256_cm4_ram.icf"/>
        <file condition="core_type.cm0p" category="header" attr="config" name="LPC54114_cm0plus.h"/>
        <file condition="core_type.cm0p" category="header" attr="config" name="LPC54114_cm0plus_features.h"/>
        <file condition="core_type.cm4f" category="header" attr="config" name="LPC54114_cm4.h"/>
        <file condition="core_type.cm4f" category="header" attr="config" name="LPC54114_cm4_features.h"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file condition="core_type.cm0p" category="sourceC" attr="config" name="system_LPC54114_cm0plus.c"/>
        <file condition="core_type.cm0p" category="header" attr="config" name="system_LPC54114_cm0plus.h"/>
        <file condition="core_type.cm4f" category="sourceC" attr="config" name="system_LPC54114_cm4.c"/>
        <file condition="core_type.cm4f" category="header" attr="config" name="system_LPC54114_cm4.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.LPC54114_AND_driver.common_AND_driver.power">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
        <file category="header" name="drivers/fsl_clock.h"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="flexcomm_i2c_cmsis" Cversion="2.0.0" condition="device.LPC54114_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.flexcomm_i2c_dma">
      <description>I2C CMSIS Driver</description>
      <files>
        <file category="sourceC" name="cmsis_drivers/fsl_i2c_cmsis.c"/>
        <file category="header" name="cmsis_drivers/fsl_i2c_cmsis.h"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="flexcomm_spi_cmsis" Cversion="2.0.0" condition="device.LPC54114_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.flexcomm_spi_dma">
      <description>SPI CMSIS Driver</description>
      <files>
        <file category="sourceC" name="cmsis_drivers/fsl_spi_cmsis.c"/>
        <file category="header" name="cmsis_drivers/fsl_spi_cmsis.h"/>
      </files>
    </component>
